# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SystemZoneData..::..Create Method
SystemZoneData Class See Also
---
Creates a new instance of a system-zone data domain class.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public static SystemZoneData Create()
```

Visual Basic
---
```text
Public Shared Function Create As SystemZoneData
```

Visual C++
---
```text
public:
static SystemZoneData^ Create()
```

# ### Return Value
The newly created data domain instance.
# See Also
SystemZoneData Class
Autodesk.Revit.DB.Mechanical Namespace